src/InformationRegisters/SocialNetworks_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>SocialNetworks_Messages</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CollaborationMessageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Incoming</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Outgoing</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>SocialConversation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Conversations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SocialUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ChatId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MessageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/FL_Jobs.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>FL_Jobs</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.FL_Exchanges</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Continuations</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreatedAt</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExpireAt</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MetadataObject</Name>
					<Comment>Provides access to the metadata object name.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Priority</Name>
					<Comment>Job priority.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>State</Name>
					<Comment>Provides the essential members for describing a background job state.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_States</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>InvocationContext</Name>
					<Comment>Serialized invocation data into XML. </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Filter</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NamespaceURI</Name>
							<Comment>URI of the name space, to which the XML type belongs.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PrimaryKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TypeName</Name>
							<Comment>A representation XML data type by XML type name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XMLValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SessionContext</Name>
					<Comment>Provides access to the runtime session context.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Session</Name>
							<Comment>Semi-permanent interactive information interchange.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueStorage</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SubscriberResources</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FieldValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Subscribers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Completed</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SubscribersLog</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Channel</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LogAttribute</Name>
							<Comment>Detailed log of the channel operations.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OriginalResponse</Name>
							<Comment>Original response from channel.</Comment>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StatusCode</Name>
							<Comment>State (reply) code returned by the HTTP service.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>StringResponse</Name>
							<Comment>Response represented as string.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Success</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SocialNetworks_Users.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>SocialNetworks_Users</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Default</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Following</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SocialNetwork</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SocialNetworks</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Unfollowing</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserRef</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/SocialNetworks_Conversations.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>SocialNetworks_Conversations</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ConversationId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessagePointer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserRef</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Chats</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ChatId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SocialUser</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SocialNetworks_Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/SocialNetworks_Events/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2018 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with this program. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#Region ProgramInterface

// Returns a processing result.
//
// Parameters:
//  Exchange - CatalogRef.FL_Exchanges - reference of the FL_Exchanges catalog.
//  Message  - CatalogRef.FL_Messages  - reference of the FL_Messages catalog.
//
// Returns:
//  Structure - see fucntion Catalogs.FL_Jobs.NewJobResult. 
//
Function ProcessMessage(Exchange, Message) Export
    
    Operation = FL_CommonUse.ObjectAttributeValue(Message, "Operation");
    If Operation = Catalogs.FL_Operations.Create Then
        Return CreateSocial(Exchange, Message);
    ElsIf Operation = Catalogs.FL_Operations.Merge Then
        Return MergeSocial(Exchange, Message);
    EndIf;
  
EndFunction // ProcessMessage()

#EndRegion // ProgramInterface

#Region ServiceInterface

// Returns the external event handler info structure for this module.
//
// Returns:
//  Structure - see function FL_InteriorUse.NewExternalEventHandlerInfo.
//
Function EventHandlerInfo() Export
    
    EventHandlerInfo = FL_InteriorUse.NewExternalEventHandlerInfo();
    EventHandlerInfo.Description = StrTemplate(NStr("
            |en='Social networks event handler, ver. %1.';
            |ru='Обработчик событий социальных сетей, вер. %1.';
            |uk='Обробник подій соціальних мереж, вер. %1.';
            |en_CA='Social networks handler, ver. %1.'"), 
        EventHandlerInfo.Version);
    EventHandlerInfo.EventHandler = "SocialNetworks_Events.ProcessMessage";
    EventHandlerInfo.Version = "1.0.4";
    EventHandlerInfo.Transactional = True;
       
    EventSources = New Array;
    EventSources.Add(Upper("HTTPService.FL_AppEndpoint"));
    EventSources.Add(Upper("HTTPСервис.FL_AppEndpoint"));
    
    EventHandlerInfo.Publishers.Insert(Catalogs.FL_Operations.Create, 
        EventSources); 
        
    EventHandlerInfo.Publishers.Insert(Catalogs.FL_Operations.Merge, 
        EventSources);
       
    Return FL_CommonUse.FixedData(EventHandlerInfo);
    
EndFunction // EventHandlerInfo()

#EndRegion // ServiceInterface

#Region ServiceProceduresAndFunctions

// Only for internal use.
//
Procedure CreateSocialMessage(SocialUser, SocialConversation, Context)
    
    SocialMessage = InformationRegisters.SocialNetworks_Messages
        .NewSocialMessage();
        
    SocialMessage.SocialConversation = SocialConversation;
    SocialMessage.SocialUser = SocialUser;
    SocialMessage.ChatId = TrimAll(Context.ChatId);
    SocialMessage.MessageID = TrimAll(Context.MessageId);
    SocialMessage.Text = TrimAll(Context.Text);
    If Context.Property("CollaborationMessageId", SocialMessage.CollaborationMessageId) Then
        SocialMessage.Incoming = False;
        SocialMessage.Outgoing = True;
    Else
        SocialMessage.Incoming = True;
        SocialMessage.Outgoing = False;    
    EndIf;
    
    If Context.Property("User") Then
        SocialMessage.User = DataProcessors.FL_CollaborationSystem
            .UserByCollaborationSystemUserID(Context.User);
    Else
        SocialMessage.User = Constants.SocialNetworks_DefaultUser.Get();
    EndIf;
    
    SupportedTypes = New Array;
    SupportedTypes.Add(Type("Date"));
    ConversionResult = FL_CommonUse.ConvertValueIntoPlatformObject(
        Context.Date, SupportedTypes);
    If ConversionResult.TypeConverted Then
        SocialMessage.Date = ConversionResult.ConvertedValue;
    Else
        SocialMessage.Date = CurrentSessionDate();   
    EndIf;
    
    InformationRegisters.SocialNetworks_Messages.CreateSocialMessage(
        SocialMessage);        
    
EndProcedure // CreateSocialMessage()

// Only for internal use.
//
Function CreateSocial(Exchange, Message)
    
    JobResult = Catalogs.FL_Jobs.NewJobResult();

    Try
        
        Context = Catalogs.FL_Messages.DeserializeContext(Message);
        
        SocialNetwork = Enums.SocialNetworks[Context.ChannelName];
        SocialUser = Catalogs.SocialNetworks_Users.SocialNetworkUser(
            TrimAll(Context.UserId), SocialNetwork, Context.Description);   
        SocialConversation = Catalogs.SocialNetworks_Conversations
            .SocialNetworkConversation(SocialUser, TrimAll(Context.ChatId));  
        CreateSocialMessage(SocialUser, SocialConversation, Context);
        
        JobResult.StatusCode = FL_InteriorUseReUse.OkStatusCode();
            
    Except

        FL_InteriorUse.WriteLog("SocialNetworks_Events.ProcessMessage", 
            EventLogLevel.Error, 
            Metadata.CommonModules.SocialNetworks_Events,
            ErrorDescription(), 
            JobResult);
        
    EndTry;
    
    JobResult.Success = FL_InteriorUseReUse.IsSuccessHTTPStatusCode(
        JobResult.StatusCode);
    Return JobResult;
    
EndFunction // CreateSocial()

// Only for internal use.
//
Function MergeSocial(Exchange, Message)
    
    JobResult = Catalogs.FL_Jobs.NewJobResult();

    Try
        
        RequestBody = Catalogs.FL_Messages.DeserializeContext(Message);
        Context = RequestBody.Object;   
        
        SupportedTypes = New Array;
        SupportedTypes.Add(Type("CatalogRef.Партнеры"));
        ConversionResult = FL_CommonUse.ConvertValueIntoPlatformObject(
            Context.Partner, SupportedTypes);
            
        Success = False;
        If ConversionResult.TypeConverted Then    
            
            UserRef = ConversionResult.ConvertedValue;
            
            SocialNetwork = Enums.SocialNetworks[Context.ChannelName];
            SocialUser = Catalogs.SocialNetworks_Users.SocialNetworkUser(
                TrimAll(Context.UserId), SocialNetwork, , UserRef);
            Catalogs.SocialNetworks_Conversations
                .SocialNetworkConversation(SocialUser, TrimAll(Context.ChatId));    
            Success = True;    
                
        EndIf;        
        
        Settings = Catalogs.FL_Exchanges.ExchangeSettingsByRefs(Exchange, 
            Message.Operation);
        StreamObject = FL_InteriorUse.NewFormatProcessor(
            Settings.BasicFormatGuid);
        
        // Open new memory stream and initialize format processor.
        Stream = New MemoryStream;
        StreamObject.Initialize(Stream, Settings.APISchema);
        
        NewContext = New Structure;
        NewContext.Insert("Settings", New Structure);
        NewContext.Settings.Insert("TaskId", Context.TaskId);
        NewContext.Settings.Insert("Success", Success);
        OutputParameters = Catalogs.FL_Exchanges.NewOutputParameters(Settings, 
            NewContext);
                    
        FL_DataComposition.Output(StreamObject, OutputParameters);
        
        // Fill MIME-type information.
        Properties = Catalogs.FL_Exchanges.NewProperties();
        FillPropertyValues(Properties, Message);
        Properties.ContentType = StreamObject.FormatMediaType();
        Properties.ContentEncoding = StreamObject.ContentEncoding;
        Properties.FileExtension = StreamObject.FormatFileExtension();
        Properties.MessageId = Message.Code;
        
        // Close format stream and memory stream.
        StreamObject.Close();
        Payload = Stream.CloseAndGetBinaryData();
        
        JobResult.StatusCode = FL_InteriorUseReUse.OkStatusCode();
        
        Catalogs.FL_Jobs.AddToJobResult(JobResult, "Payload", Payload);     
        Catalogs.FL_Jobs.AddToJobResult(JobResult, "Properties", Properties); 
            
    Except
        
        FL_InteriorUse.WriteLog("SocialNetworks_Events.ProcessMessage", 
            EventLogLevel.Error,
            Metadata.Catalogs.FL_Exchanges,
            ErrorDescription(),
            JobResult);
        
    EndTry;
    
    JobResult.Success = FL_InteriorUseReUse.IsSuccessHTTPStatusCode(
        JobResult.StatusCode);
    Return JobResult;
    
EndFunction // MergeSocial()

#EndRegion // ServiceProceduresAndFunctions
